export const regions = [
  {
    sido: '서울특별시',
    sigungu: [
      '강남구', '강동구', '강북구', '강서구', '관악구', '광진구', '구로구', '금천구', '노원구', '도봉구',
      '동대문구', '동작구', '마포구', '서대문구', '서초구', '성동구', '성북구', '송파구', '양천구', '영등포구',
      '용산구', '은평구', '종로구', '중구', '중랑구'
    ],
  },
  {
    sido: '경기도',
    sigungu: [
      '수원시', '성남시', '고양시', '용인시', '부천시', '안산시', '안양시', '남양주시', '의정부시', '평택시',
      '시흥시', '화성시', '파주시', '광명시', '군포시', '오산시', '이천시', '김포시', '안성시', '의왕시',
      '하남시', '광주시', '여주시', '양평군', '동두천시', '과천시', '구리시', '포천시', '연천군', '가평군'
    ],
  },
  {
    sido: '인천광역시',
    sigungu: ['계양구', '미추홀구', '남동구', '동구', '부평구', '서구', '연수구', '중구', '강화군', '옹진군'],
  },
  // 필요하다면 다른 시/도 데이터를 여기에 추가할 수 있습니다.
];